----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1         [-1, 64, 222, 222]           3,456
       BatchNorm2d-2         [-1, 64, 222, 222]             128
            Conv2d-3         [-1, 64, 220, 220]          36,864
       BatchNorm2d-4         [-1, 64, 220, 220]             128
         MaxPool2d-5         [-1, 64, 109, 109]               0
         Dropout2d-6         [-1, 64, 109, 109]               0
            Conv2d-7        [-1, 128, 107, 107]          73,728
       BatchNorm2d-8        [-1, 128, 107, 107]             256
            Conv2d-9        [-1, 128, 105, 105]         147,456
      BatchNorm2d-10        [-1, 128, 105, 105]             256
        MaxPool2d-11          [-1, 128, 52, 52]               0
        Dropout2d-12          [-1, 128, 52, 52]               0
           Conv2d-13          [-1, 256, 50, 50]         294,912
      BatchNorm2d-14          [-1, 256, 50, 50]             512
           Conv2d-15          [-1, 256, 48, 48]         589,824
      BatchNorm2d-16          [-1, 256, 48, 48]             512
        MaxPool2d-17          [-1, 256, 23, 23]               0
        Dropout2d-18          [-1, 256, 23, 23]               0
           Conv2d-19          [-1, 512, 21, 21]       1,179,648
      BatchNorm2d-20          [-1, 512, 21, 21]           1,024
           Conv2d-21          [-1, 512, 19, 19]       2,359,296
      BatchNorm2d-22          [-1, 512, 19, 19]           1,024
        MaxPool2d-23            [-1, 512, 9, 9]               0
        Dropout2d-24            [-1, 512, 9, 9]               0
           Conv2d-25           [-1, 1024, 9, 9]       4,719,616
      BatchNorm2d-26           [-1, 1024, 9, 9]           2,048
           Conv2d-27           [-1, 1024, 9, 9]       9,438,208
      BatchNorm2d-28           [-1, 1024, 9, 9]           2,048
        MaxPool2d-29           [-1, 1024, 4, 4]               0
        Dropout2d-30           [-1, 1024, 4, 4]               0
           Linear-31                 [-1, 1024]      16,778,240
           Linear-32                    [-1, 1]           1,025
================================================================
Total params: 35,630,209
Trainable params: 35,630,209
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 1.15
Forward/backward pass size (MB): 186.69
Params size (MB): 135.92
Estimated Total Size (MB): 323.76
----------------------------------------------------------------